package manual;

import extensions.Manual;
import io.qameta.allure.*;
import org.junit.jupiter.api.*;

/**
 * Ручные тест-кейсы для страницы передачи показаний.
 */
@Epic("Ручное тестирование")
@Feature("Передача показаний")
@Story("Сложные и неавтоматизируемые сценарии")
@TestMethodOrder(MethodOrderer.OrderAnnotation.class)

public class ManualTests {

    @Test
    @Manual
    @DisplayName("TC-MANUAL-READ-001: Обрыв связи при отправке показаний")
    @Description("""
        Цель: Проверить, как приложение обрабатывает потерю соединения в критический момент.
        Предусловия:
        - Пользователь авторизован, открыта страница передачи показаний.
        - Введено валидное новое показание.
        Ожидаемый результат:
        - Приложение не должно "упасть" (crash).
        - Должно появиться понятное сообщение: "Нет подключения к интернету".
        - Данные не должны быть потеряны или отправлены задвоением.
    """)
    @Severity(SeverityLevel.NORMAL)
    @Tags({@Tag("manual"), @Tag("regression")})
    void testNetworkLossDuringSubmission() {
        Allure.step("1. Подготовить данные. Введите валидное показание в поле для передачи показаний", () -> {});
        Allure.step("2. Разорвать соединение. Включите 'Авиарежим' на телефоне.", () -> {});
        Allure.step("3. Попытаться отправить. Нажмите 'Отправить показания' и зафиксируйте реакцию UI.", () -> {});
        Allure.step("4. Восстановить соединениею Выключите 'Авиарежим' " +
                "и проверьте, отправилось ли показание или появилась корректная ошибка.", () ->{});
    }

    @Test
    @Manual
    @DisplayName("TC-MANUAL-READ-002: Сценарий смены прибора учета")
    @Description("""
        Цель: Проверить корректность отображения и логику ввода при смене счетчика.
        Предусловия:
        - На тестовом ЛС оформлена замена ПУ (старый ПУ выведен из эксплуатации, новый введен).
        Ожидаемый результат:
        - UI четко разделяет "Последние показания по старому ПУ" и "Введите показания по новому ПУ".
        - Система принимает начальное показание нового ПУ без ошибок валидации "меньше предыдущего" 
        (так как предыдущего для нового ПУ еще нет).
    """)
    @Severity(SeverityLevel.CRITICAL)
    @Tags({@Tag("manual"), @Tag("regression")})
    void testMeterReplacementScenario() {
        Allure.step("1. Проверить отображение двух ПУ. Убедитесь, что старый ПУ помечен как 'Заменен', а новый активен.", () ->{});
        Allure.step("2. Проверить блокировку старого ПУ. Попробуйте ввести данные в поле старого ПУ (должно быть невозможно).", () ->{});
        Allure.step("3. Ввести данные нового ПУ. Введите начальное показание для нового счетчика и отправьте.", () -> {});
    }

    @Test
    @Manual
    @DisplayName("TC-MANUAL-READ-003: Граничные условия периода передачи (25-е число)")
    @Description("""
        Цель: Проверить поведение системы в момент закрытия/открытия периода передачи.
        Предусловия:
        - Период передачи показаний: с 1 по 25 число каждого месяца
        Ожидаемый результат:
        - После 25-го числа текст "Сейчас время передачи показаний" должен исчезнуть или измениться на "Передача показаний начнется 1 числа".
        - Кнопка "Отправить показания" должна стать неактивной или выдавать предупреждение о том, что период закрыт.
    """)
    @Severity(SeverityLevel.NORMAL)
    @Tags({@Tag("manual"), @Tag("regression")})
    void testTransmissionPeriodBoundary() {
        Allure.step("1. Тест внутри периода. Установите дату 25.XX, проверьте успешную отправку.", () ->{});
        Allure.step("2. Тест вне периода. Установите дату 26.XX, обновите экран.", () ->{});
        Allure.step("3. Проверка блокировки. Убедитесь, что отправка заблокирована и текст информативен.", () -> {});
    }

    @Test
    @Manual
    @DisplayName("TC-MANUAL-READ-004: Юзабилити и доступность ввода")
    @Description("""
        Цель: Оценить удобство использования формы передачи показаний реальным человеком.
        Предусловия:
        - Открыта страница передачи показаний на реальном мобильном устройстве
        Ожидаемый результат:
        - Интерфейс адаптируется при открытии клавиатуры (скроллится к активному полю).
        - Все элементы интерактивны и хорошо читаемы.
    """)
    @Severity(SeverityLevel.NORMAL)
    @Tags({@Tag("manual"), @Tag("regression")})
    void testUsabilityAndAccessibility() {
        Allure.step("1. Проверка клавиатуры. Откройте клавиатуру. Перекрывает ли она кнопку 'Отправить'?", () ->{});
        Allure.step("2. Проверка размера тап-зон. Попробуйте нажать на поля и кнопки. Удобно ли это делать большим пальцем?", () ->{});
        Allure.step("3. Проверка доступности. (Опционально) Включите TalkBack и проверьте озвучку полей.", () -> {});
    }

    @Test
    @Manual
    @DisplayName("TC-MANUAL-READ-005: Адаптивность на разных размерах экранов")
    @Description("""
        Цель: Убедиться, что верстка страницы показаний не "ломается" на устройствах с нестандартными разрешениями.
        Предусловия:
        - Доступ к эмуляторам/устройствам с разными экранами .
       Ожидаемый результат:
        - Нет горизонтального скролла.
        - Текст не обрезается многоточием в критичных местах (название ПУ, номер).
        - Кнопка "Отправить" всегда доступна (прилипает к низу или находится в конце скролла).
    """)
    @Severity(SeverityLevel.NORMAL)
    @Tags({@Tag("manual"), @Tag("regression")})
    void testCrossDeviceResponsiveness() {
        Allure.step("1. Тест на малом экране. Запустите на эмуляторе с разрешением, например, 375x667. Проверьте перенос текста.", () ->{});
        Allure.step("2. Тест на большом экране. Запустите на эмуляторе планшета. Проверьте отсутствие пустых гигантских отступов.", () ->{});
        Allure.step("3. Проверка скролла. Убедитесь, что до кнопки 'Отправить' можно доскроллить на любом размере.", () ->{});
    }
}